tutorials/incompressible/adjointOptimisationFoam/shapeOptimisation/fork-uneven/uniformityPatch/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
    (0     0      0)  //0
    (0.1   0      0)  //1
    (0.1   0.05   0)  //2
    (0     0.05   0)  //3
    (0.1   0.1    0)  //4
    (0     0.1    0)  //5
    (0.2  -0.05   0)  //6
    (0.2   0      0)  //7
    (0.2   0.05   0)  //8
    (0.2   0.1    0)  //9
    (0.3  -0.05   0)  //10
    (0.3   0      0)  //11
    (0.3   0.05   0)  //12
    (0.3   0.1    0)  //13

    (0     0      -0.1)  //0
    (0.1   0      -0.1)  //1
    (0.1   0.05   -0.1)  //2
    (0     0.05   -0.1)  //3
    (0.1   0.1    -0.1)  //4
    (0     0.1    -0.1)  //5
    (0.2  -0.05   -0.1)  //6
    (0.2   0      -0.1)  //7
    (0.2   0.05   -0.1)  //8
    (0.2   0.1    -0.1)  //9
    (0.3  -0.05   -0.1)  //10
    (0.3   0      -0.1)  //11
    (0.3   0.05   -0.1)  //12
    (0.3   0.1    -0.1)  //13
);

blocks
(
    hex (0 1  15 14 3 2  16 17) (50 1 50) simpleGrading (1 1 1.5  )
    hex (3 2  16 17 5 4  18 19) (50 1 50) simpleGrading (1 1 0.667)
    hex (1 6  20 15 2 7  21 16) (50 1 50) simpleGrading (1 1 1.5)
    hex (2 8  22 16 4 9  23 18) (50 1 50) simpleGrading (1 1 0.667)
    hex (6 10 24 20 7 11 25 21) (50 1 50) simpleGrading (1 1 1.5)
    hex (8 12 26 22 9 13 27 23) (50 1 50) simpleGrading (1 1 0.667)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (3 0 14 17)
            (5 3 17 19)
        );
    }
    outlet1
    {
        type patch;
        faces
        (
            (12 13 27 26)
        );
    }

    outlet2
    {
        type patch;
        faces
        (
            (10 11 25 24)
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (4 18 23 9)
            (5 19 18 4)
            (9 23 27 13)

        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 1  15 14)
            (1 6  20 15)
            (6 10 24 20)
        );
    }
    middleWall
    {
        type wall;
        faces
        (
            (2 16 21 7)
            (7 21 25 11)
            (2 8  22 16)
            (8 12 26 22)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
